#include <iostream>
//#include "task1.h"
#include "file1.h"
#include "file2.h"



using namespace std;


/*
Задание 2
Дан текстовый файл. Необходимо создать новый файл и записать в него следующую статистику по исходному файлу:

Количество символов;
Количество строк;
Количество гласных букв;
Количество согласных букв;
Количество цифр.
Задание 3
Шифр Цезаря — один из древнейших шифров. При шифровании каждый символ заменяется другим, отстоящим от него в алфавите на фиксированное число позиций.

Пример

Шифрование с использованием ключа: 3
Оригинальный текст: Съешь же ещё этих мягких французских булок, да выпей чаю.
Шифрованный текст: Фэзыя йз зьи ахлш пвёнлш чугрщцкфнлш дцосн, жг еютзм ъгб.

//
Дан текстовый файл. Зашифровать его, используя шифр Цезаря. Результат записать в другой файл.

*/



int main()
{
//#ifdef task1

	//file1 f1;
	//file2 f2;

	//Openfiles(f1);
	////cout << "File contents:\n" << f1.bufffile << endl;

	//Openfiles(f2);
	////cout << "File contents:\n" << f2.bufffile << endl;

	//CompareFiles(f1, f2);

//#elif define task2








//#endif
}
